Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.kubernetes_manifest.grafana-agent-ingress will be created
+ resource "kubernetes_manifest" "grafana-agent-ingress" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "IngressRoute"
          + metadata   = {
              + name      = "grafana-agent-ingress"
              + namespace = "grafana"
            }
          + spec       = {
              + entryPoints = [
                  + "web",
                ]
              + routes      = [
                  + {
                      + kind     = "Rule"
                      + match    = "PathPrefix(`/grafana-agent`)"
                      + services = [
                          + {
                              + name = "grafana-agent"
                              + port = 80
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "IngressRoute"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "grafana-agent-ingress"
              + namespace                  = "grafana"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + entryPoints = [
                  + "web",
                ]
              + routes      = [
                  + {
                      + kind        = "Rule"
                      + match       = "PathPrefix(`/grafana-agent`)"
                      + middlewares = (known after apply)
                      + priority    = (known after apply)
                      + services    = [
                          + {
                              + kind               = (known after apply)
                              + name               = "grafana-agent"
                              + namespace          = (known after apply)
                              + nativeLB           = (known after apply)
                              + passHostHeader     = (known after apply)
                              + port               = "80"
                              + responseForwarding = {
                                  + flushInterval = (known after apply)
                                }
                              + scheme             = (known after apply)
                              + serversTransport   = (known after apply)
                              + sticky             = {
                                  + cookie = {
                                      + httpOnly = (known after apply)
                                      + name     = (known after apply)
                                      + sameSite = (known after apply)
                                      + secure   = (known after apply)
                                    }
                                }
                              + strategy           = (known after apply)
                              + weight             = (known after apply)
                            },
                        ]
                    },
                ]
              + tls         = {
                  + certResolver = (known after apply)
                  + domains      = (known after apply)
                  + options      = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + secretName   = (known after apply)
                  + store        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`